Revit 2024 API
Stone.StoneApplication Property
 The property labeled "Finish" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string StoneApplication { get; }
Visual Basic
Public Shared ReadOnly Property StoneApplication As String
	Get
Visual C++
public:
static property String^ StoneApplication {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "StoneApplicationType".
See Also
Stone Class
Autodesk.Revit.DB.Visual Namespace